#Задача 30:  Заполните массив элементами арифметической прогрессии. Её первый элемент, разность и количество 
#элементов нужно ввести с клавиатуры. Формула для получения n-го члена прогрессии: an = a1 + (n-1) * d.
#Каждое число вводится с новой строки.

#first_element = int(input("Введите первый элемент арифметической прогрессии "))

#difference = int(input("Введите разность "))

#number_of_elements = int(input("Введите количество элементов  "))

#for i in range(number_of_elements):
#    print(first_element + i*difference)

#Задача 32: Определить индексы элементов массива (списка), значения которых принадлежат заданному диапазону 
#(т.е. не меньше заданного минимума и не больше заданного максимума)

# max_index = int(input("Введите верхнюю границу"))
# min_index = int(input("Введите нижнюю границу"))

# list = [2, 3, -9, 0, 16, 22, 47, 18, 54, -2, 0, 1]

# for element in range(len(list)):
#     if min_index <= list[element] <= max_index:
#         print(element)

a = '@'
b = '.'
print(a and b)


